 Uvozi

In [6]:
import pandas as pd
%matplotlib inline

Razpredelnice

In [47]:
judoke = pd.read_csv('judoke.csv')#, index_col='id')
medalje = pd.read_csv('medalje.csv')#, index_col='id')

# ker bomo delali z velikimi razpredelnicami, povemo, da naj se vedno izpiše le 16 vrstic in stolpcev
pd.options.display.max_rows = 15
pd.options.display.max_columns = 16

In [48]:
judoke

         id                      ime drzava  tocke
0       385              RINER Teddy    FRA   3250
1     11651       HARASAWA Hisayoshi    JPN   2830
2      3278                SASSON Or    ISR   1992
3      3393             NATEA Daniel    ROU   1930
4      3394                MEYER Roy    NED   1862
5     14698             KHAMMO Iakiv    UKR   1820
6       245                BOR Barna    HUN   1492
...     ...                      ...    ...    ...
3393  12230           TOPRAK Firdevs    TUR      1
3394  10944         ALVAREZ Graciela    ARG      1
3395  12148            BONILLA Luisa    COL      1
3396  12732        WANGECHI Ceciliah    KEN      1
3397  15252  ATUVAHA Marie genevieve    NCL      1
3398  16237         BOGNINI Germaine    BUR      1
3399  22587            VINITA Vinita    IND      1

[3400 rows x 4 columns]

In [49]:
medalje

        id  zlato  srebro  bron
0     6998      0       0     0
1     4525      0       0     0
2    13770      0       0     0
3    15969      0       0     0
4     9187      0       0     0
5     2317      0       1     0
6     1039      0       0     2
..     ...    ...     ...   ...
502  26373      0       0     0
503   9361      0       0     0
504   2968      0       0     0
505  11708      0       0     0
506   7009      0       0     0
507  12564      0       0     0
508   1012      0       0     0

[509 rows x 4 columns]

In [51]:
db=pd.merge(judoke, medalje)

In [52]:
db

,id,ime,drzava,tocke,zlato,srebro,bron
0,385,RINER Teddy,FRA,3250,2,0,0
1,11651,HARASAWA Hisayoshi,JPN,2830,0,1,0
2,3278,SASSON Or,ISR,1992,0,0,1
3,3393,NATEA Daniel,ROU,1930,0,0,0
4,3394,MEYER Roy,NED,1862,0,0,0
5,14698,KHAMMO Iakiv,UKR,1820,0,0,0
6,245,BOR Barna,HUN,1492,0,0,0
...,...,...,...,...,...,...,...
520,1622,POGORZELEC Daria,POL,680,0,0,0
521,7231,MBALLA ATANGANA Hortence vanessa,CMR,625,0,0,0
522,181,RAMIREZ Yahima,POR,465,0,0,0
523,1352,OGATA Akari,JPN,410,0,0,0
524,665,THIELE Kerstin,GER,208,0,1,0
525,371,MOSKALYUK Vera,RUS,130,0,0,0
526,61,JEONG Gyeong-Mi,KOR,50,0,0,0